[
  {
    "id": "1",
    "propertyName": "Luxury Apartment in Gulshan",
    "description": "This luxurious 3-bedroom apartment in Gulshan offers the perfect blend of comfort and sophistication. Each room is designed with large windows, allowing natural light to brighten the space. The apartment features modern fittings, a fully equipped kitchen, a spacious living room, and a private balcony with a stunning city view. Located in one of Dhaka’s most prestigious areas, it offers easy access to restaurants, schools, and shopping malls. With 24/7 security and dedicated parking, this apartment ensures both safety and convenience for your family’s lifestyle.",
    "price": 32000000,
    "location": "Gulshan, Dhaka",
    "category": "Apartment",
    "image": "https://i.ibb.co.com/cKFkR2BF/dfc2e689664c17fdfb68fd4887bdd04c.jpg",
    "postedDate": "2025-10-10",
    "postedBy": "Rashedul Islam"
  },
  {
    "id": "2",
    "propertyName": "Lake View Villa",
    "description": "Experience serenity and elegance with this spacious 5-bedroom villa located beside the tranquil lakes of Uttara. The property includes a beautifully landscaped private garden, a swimming pool, and wide balconies offering breathtaking water views. The villa’s open-concept living area and high ceilings create a grand atmosphere, while the modern kitchen and attached bathrooms add comfort. Ideal for families who value privacy and luxury, this home provides an escape from the city rush while keeping you close to top schools, restaurants, and shopping centers.",
    "price": 65000000,
    "location": "Uttara, Dhaka",
    "category": "Villa",
    "image": "https://i.ibb.co.com/VcSMGKf7/025be22916b9c27fdd94e6a3fb2e0583.jpg",
    "postedDate": "2025-10-12",
    "postedBy": "Amina Rahman"
  },
  {
    "id": "3",
    "propertyName": "Cozy Family Flat",
    "description": "This cozy family flat in Banani is perfect for small families looking for a peaceful and convenient lifestyle. The 2-bedroom apartment features a wide balcony, an airy living room, and modern kitchen amenities. It offers lift access, 24/7 security, and a backup generator to ensure uninterrupted comfort. The surrounding neighborhood is quiet yet close to all essential facilities such as schools, parks, hospitals, and supermarkets. With its affordable price and warm ambiance, this flat is a great choice for those starting a new chapter of family life.",
    "price": 14500000,
    "location": "Banani, Dhaka",
    "category": "Flat",
    "image": "https://i.ibb.co.com/pB79JvXT/07abb79c5dc5f80f5190150b9d050700.jpg",
    "postedDate": "2025-10-14",
    "postedBy": "Sabbir Hossain"
  },
  {
    "id": "4",
    "propertyName": "Duplex House",
    "description": "A modern architectural masterpiece located in Bashundhara, this duplex house offers elegance, comfort, and functionality. With its spacious layout, large windows, and natural lighting, the home creates a luxurious yet homely environment. It features five well-furnished bedrooms, a designer kitchen, and a rooftop garden perfect for relaxation. The interior is finished with premium materials, ensuring durability and class. Ideal for large families, this property combines privacy with accessibility, being just minutes away from shopping malls, schools, and top restaurants.",
    "price": 42000000,
    "location": "Bashundhara, Dhaka",
    "category": "Duplex",
    "image": "https://i.ibb.co.com/tPFbCBBH/a5bffc3f09c619eca3d961656e31b2d7.jpg",
    "postedDate": "2025-10-16",
    "postedBy": "Moumita Chowdhury"
  },
  {
    "id": "5",
    "propertyName": "Studio Apartment",
    "description": "Designed for bachelors and young professionals, this studio apartment in Khilkhet combines simplicity with modern living. It includes an open bedroom-living concept, kitchenette, and attached bathroom. The building is well-maintained and offers 24-hour security and backup electricity. Its prime location near the airport provides easy access to transport and business hubs. Compact yet elegant, the apartment’s efficient layout makes the most of every inch of space. Ideal for anyone seeking a peaceful lifestyle without compromising convenience and affordability.",
    "price": 7500000,
    "location": "Khilkhet, Dhaka",
    "category": "Studio",
    "image": "https://i.ibb.co.com/C52TkSry/712c5729dbb34f67af5fa967755fd613.jpg",
    "postedDate": "2025-10-18",
    "postedBy": "Tanvir Ahmed"
  },
  {
    "id": "6",
    "propertyName": "Corporate Office Space",
    "description": "This ready-to-move-in corporate office space in Motijheel offers 2000 sq. ft of fully furnished workspace designed for productivity and professionalism. The property includes conference rooms, private cabins, a reception area, and an employee lounge. Equipped with modern lighting and central air conditioning, it provides a comfortable working environment. Located in the heart of Dhaka’s business district, this office ensures high visibility and easy accessibility. Perfect for startups and established companies looking to expand their operations with elegance and convenience.",
    "price": 55000000,
    "location": "Motijheel, Dhaka",
    "category": "Commercial",
    "image": "https://i.ibb.co.com/ns6DmTtk/4557c0fbe1f8999a674bf6afc43f4662.jpg",
    "postedDate": "2025-10-20",
    "postedBy": "Sajjad Karim"
  },
  {
    "id": "7",
    "propertyName": "Riverside Cottage",
    "description": "Nestled beside the beautiful Buriganga River, this charming riverside cottage provides an ideal getaway for relaxation and peace. The property features a spacious living area, two cozy bedrooms, and a veranda overlooking the river. Surrounded by nature, it offers a calm atmosphere away from the city’s hustle. Built with natural materials, it maintains a rustic yet modern aesthetic. Whether used as a weekend retreat or a permanent residence, this cottage offers an unmatched sense of serenity and comfort for nature lovers.",
    "price": 27000000,
    "location": "Keraniganj, Dhaka",
    "category": "Cottage",
    "image": "https://i.ibb.co.com/v64XNJXc/7e17051f2a4966102398737ab2fa55f0.jpg",
    "postedDate": "2025-10-21",
    "postedBy": "Faria Rahman"
  },
  {
    "id": "8",
    "propertyName": "Modern Townhouse",
    "description": "Located in Baridhara, this newly built townhouse is a perfect mix of modern architecture and functional design. The home offers spacious rooms, high ceilings, and large windows that ensure plenty of natural light. It includes four bedrooms, three bathrooms, and a large parking space. The rooftop provides a relaxing area with a panoramic city view. With premium fittings, stylish flooring, and a secured neighborhood, this property is ideal for families looking for an upscale and comfortable lifestyle in Dhaka.",
    "price": 38000000,
    "location": "Baridhara, Dhaka",
    "category": "Townhouse",
    "image": "https://i.ibb.co.com/BhKhTGg/4ab940c060fa2126927aece7d2bc1885.jpg",
    "postedDate": "2025-10-22",
    "postedBy": "Rafiq Mahmud"
  },
  {
    "id": "9",
    "propertyName": "Penthouse with Rooftop Pool",
    "description": "This ultra-luxury penthouse in Gulshan-2 offers breathtaking skyline views and a private rooftop pool. The interiors feature imported marble flooring, designer lighting, and floor-to-ceiling glass windows. With five bedrooms, a spacious lounge, and a gourmet kitchen, this property redefines elegance. The outdoor terrace is perfect for hosting gatherings or enjoying sunset views. Ensuring top security and premium amenities, this penthouse is tailored for elite families who value privacy, comfort, and prestige in one of Dhaka’s most desired neighborhoods.",
    "price": 98000000,
    "location": "Gulshan-2, Dhaka",
    "category": "Penthouse",
    "image": "https://i.ibb.co.com/yFTdm7Y3/2a316389615cdbdaca0039d5e6c744b1.jpg",
    "postedDate": "2025-10-23",
    "postedBy": "Nusrat Jahan"
  },
  {
    "id": "10",
    "propertyName": "Suburban Family Home",
    "description": "This suburban family home in Savar combines tranquility and modern living in one package. The spacious 3-bedroom property includes a green front yard, private garage, and large open kitchen. Each room is designed for ventilation and comfort. Perfect for families seeking a peaceful life away from Dhaka’s busy center, yet close enough for easy commuting. Built with quality materials and attention to detail, this home offers a secure and sustainable lifestyle with the warmth of suburban charm and community living.",
    "price": 25000000,
    "location": "Savar, Dhaka",
    "category": "House",
    "image": "https://i.ibb.co.com/yFTdm7Y3/2a316389615cdbdaca0039d5e6c744b1.jpg",
    "postedDate": "2025-10-24",
    "postedBy": "Rashedul Islam"
  },
  {
    "id": "11",
    "propertyName": "Luxury Beach House",
    "description": "Located along the serene coast of Cox’s Bazar, this private beach villa provides an extraordinary living experience. The villa includes an infinity pool overlooking the sea, wide glass walls, and modern interior design. It offers five bedrooms, a home theater, and a fully equipped gourmet kitchen. The soft sound of the waves and fresh ocean breeze create the perfect environment for relaxation. This luxurious beach house ensures ultimate privacy, breathtaking views, and unmatched comfort for those who value seaside living.",
    "price": 120000000,
    "location": "Cox’s Bazar",
    "category": "Beach House",
    "image": "https://i.ibb.co.com/mCyJBbpr/89926b12a2cfac468ccb13b4e525816e.jpg",
    "postedDate": "2025-10-25",
    "postedBy": "Mahiya Akter"
  },
  {
    "id": "12",
    "propertyName": "Downtown Apartment",
    "description": "Perfectly located in Mirpur’s city center, this fully furnished apartment provides the ideal balance of convenience and style. The apartment includes two bedrooms, a modern kitchen, and a living area with large windows for natural lighting. The building has lift access, 24/7 security, and a rooftop garden. Close to metro stations, shopping malls, and restaurants, it’s ideal for urban professionals and small families. The combination of functionality, design, and location makes this apartment a great investment and living opportunity.",
    "price": 19000000,
    "location": "Mirpur, Dhaka",
    "category": "Apartment",
    "image": "https://i.ibb.co.com/6cr5tb1k/54b61886e7d4850ec05309dc931c8a67.jpg",
    "postedDate": "2025-10-26",
    "postedBy": "Farhan Alam"
  },
  {
    "id": "13",
    "propertyName": "Eco Green Villa",
    "description": "The Eco Green Villa in Bashundhara is designed for those who prioritize sustainability and modern living. This 4-bedroom villa is equipped with solar panels, rainwater harvesting, and energy-efficient appliances. The spacious layout allows plenty of natural airflow, while the lush green surroundings add to its charm. With premium interior finishes, a large garden, and proximity to schools and shopping malls, this villa offers the perfect combination of luxury and environmental consciousness for eco-friendly families.",
    "price": 78000000,
    "location": "Bashundhara R/A, Dhaka",
    "category": "Villa",
    "image": "https://i.ibb.co.com/nsv88NWg/b20829160dc4f53b1dde196f7d1e113f.jpg",
    "postedDate": "2025-10-27",
    "postedBy": "Shaila Haque"
  },
  {
    "id": "14",
    "propertyName": "Modern Duplex",
    "description": "This elegant modern duplex in Dhanmondi combines contemporary design with functionality. It features a spacious living area, modern kitchen, and four bedrooms with attached baths. The property includes a private garden and terrace that provide ample space for family gatherings. Designed with high-quality materials and neutral tones, it offers a warm, inviting ambiance. Located in a prestigious neighborhood, this duplex ensures convenience, with schools, hospitals, and shopping complexes just a few minutes away.",
    "price": 48000000,
    "location": "Dhanmondi, Dhaka",
    "category": "Duplex",
    "image": "https://i.ibb.co.com/cKCcnGT3/321b2736be1327f8d20aa6c8a6e36a9f.png",
    "postedDate": "2025-10-28",
    "postedBy": "Asif Hasan"
  },
  {
    "id": "15",
    "propertyName": "Hill View Resort",
    "description": "Surrounded by the scenic beauty of Bandarban’s hills, this hill view resort offers an unforgettable living experience. The resort features luxurious rooms, an infinity pool, and a spa area overlooking the mountains. Built with eco-friendly materials, it blends seamlessly with nature. Guests can enjoy modern amenities while embracing peace and adventure. Ideal for investors or hospitality businesses, this property promises a relaxing environment and high potential for tourism growth in one of Bangladesh’s most stunning destinations.",
    "price": 95000000,
    "location": "Bandarban",
    "category": "Resort",
    "image": "https://i.ibb.co.com/rR5PKpjt/6eb78bc1756dda46d3fed1c828b9737d.jpg",
    "postedDate": "2025-10-29",
    "postedBy": "Rubel Chowdhury"
  },
  {
    "id": "16",
    "propertyName": "Smart Apartment",
    "description": "This tech-enabled smart apartment in Banani offers next-generation living. Equipped with IoT devices, smart locks, voice-controlled lights, and digital security, it ensures both luxury and safety. The apartment includes two spacious bedrooms, a modular kitchen, and a modern living room. With top-notch design, natural ventilation, and access to all modern facilities, it’s ideal for tech enthusiasts and working professionals. The property’s premium location adds to its appeal, offering convenience and connectivity in the heart of the city.",
    "price": 36000000,
    "location": "Banani, Dhaka",
    "category": "Apartment",
    "image": "https://i.ibb.co.com/rR5PKpjt/6eb78bc1756dda46d3fed1c828b9737d.jpg",
    "postedDate": "2025-10-30",
    "postedBy": "Mahbub Alam"
  },
  {
    "id": "17",
    "propertyName": "Luxury Office Tower",
    "description": "Standing tall in Motijheel, this luxury office tower offers a professional environment with panoramic city views. It features multiple office floors, meeting rooms, and a premium lobby area. Each floor is designed with open workspaces, modern lighting, and energy-efficient infrastructure. The building includes elevator service, backup power, and 24-hour security. Perfect for corporate headquarters or multinational firms, it provides accessibility, prestige, and comfort in Dhaka’s most important business hub.",
    "price": 200000000,
    "location": "Motijheel, Dhaka",
    "category": "Commercial",
    "image": "https://i.ibb.co.com/SD1CYspk/6e38228f32905c8304b8065250b6e42e.jpg",
    "postedDate": "2025-11-01",
    "postedBy": "Nasim Rahman"
  },
  {
    "id": "18",
    "propertyName": "Budget Family Apartment",
    "description": "An affordable yet elegant family apartment located in Mirpur-10, perfect for small families. The apartment features two bedrooms, a modern kitchen, and a bright living area. Built with durable materials, it ensures long-term comfort. The building includes elevator service, rooftop access, and security personnel. Situated near schools, markets, and transportation, it provides everything you need for everyday life. It’s an ideal investment for families seeking budget-friendly urban living with comfort and accessibility.",
    "price": 9800000,
    "location": "Mirpur-10, Dhaka",
    "category": "Apartment",
    "image": "https://i.ibb.co.com/LXNkrvvQ/01007edc6cc08f35a4a0653d5de71eb0.jpg",
    "postedDate": "2025-11-02",
    "postedBy": "Shamima Akter"
  },
  {
    "id": "19",
    "propertyName": "River View Duplex",
    "description": "This beautiful duplex in Ashulia offers an exclusive river view and a relaxing environment. Designed for luxury and comfort, it features four bedrooms, a spacious living room, and a wide balcony overlooking the river. The home includes a modern kitchen, elegant interiors, and natural light throughout. With easy access to major roads, it’s ideal for families who want peaceful living near the city. Every corner is thoughtfully designed to create harmony with nature while maintaining a sophisticated and stylish lifestyle for its residents.",
    "price": 55000000,
    "location": "Ashulia, Dhaka",
    "category": "Duplex",
    "image": "https://i.ibb.co.com/VYK99J9M/bd03bb3ddebd00eef9e9cda6de659c16.jpg",
    "postedDate": "2025-11-03",
    "postedBy": "Tariq Khan"
  },
  {
    "id": "20",
    "propertyName": "Classic Heritage House",
    "description": "Located in the heart of Old Dhaka, this Classic Heritage House is a perfect combination of traditional architecture and modern interior design. The house has been carefully renovated to maintain its historical charm while adding new-age conveniences. It features spacious rooms, wooden detailing, high ceilings, and a private courtyard. Perfect for art enthusiasts and heritage lovers, this property reflects the culture and elegance of the past. With its unique structure and prime location, this heritage home is truly a timeless piece of living art.",
    "price": 47000000,
    "location": "Old Dhaka",
    "category": "Heritage",
    "image": "https://i.ibb.co.com/r2RmHKX1/7a7b20c29bb5198d3389dd94f646bf6f.jpg",
    "postedDate": "2025-11-04",
    "postedBy": "Rumana Sultana"
  }
]